{"numResults": 25813, "facets": {"_total": 1, "values": [{"buckets": {"_total": 11, "values": [{"count": 1893, "selected": false, "code": "1073", "name": "EY"}, {"count": 508, "selected": false, "code": "1038", "name": "Deloitte"}, {"count": 501, "selected": false, "code": "3743", "name": "McGladrey"}, {"count": 497, "selected": false, "code": "1767", "name": "State Street"}, {"count": 496, "selected": false, "code": "1226", "name": "Army National Guard"}, {"count": 391, "selected": false, "code": "1351", "name": "Morgan Stanley Wealth Management"}, {"count": 365, "selected": false, "code": "1079", "name": "KPMG US"}, {"count": 329, "selected": false, "code": "1009", "name": "IBM"}, {"count": 261, "selected": false, "code": "1103", "name": "Verizon"}, {"count": 245, "selected": false, "code": "1067", "name": "J.P. Morgan"}, {"count": 210, "selected": false, "code": "3486", "name": "Hays"}]}, "code": "company", "name": "Company"}]}, "jobs": {"_total": 25813, "_count": 20, "_start": 0, "values": [{"company": {"id": 1028, "name": "Oracle"}, "descriptionSnippet": "Responsibilities: The Director, M&amp;A Consolidations &amp; Purchase Accounting is a global role that is responsible for on-time and accurate monthly and quarterly financial reporting associated with the acquired entities of Oracle prior to integration. This position will be leading a team of 2 direct reports and 4 staff level accountants to provide direction and mentoring with respect to ensurin", "locationDescription": "San Francisco Bay Area", "id": 9156268, "jobPoster": {"headline": "Senior Corporate Recruiter, Oracle Corporation", "lastName": "M.", "id": "vkRpfJ_hcI", "firstName": "Brock"}}, {"company": {"id": 2722, "name": "KLA-Tencor"}, "descriptionSnippet": "KLA-Tencor seeks an Accounting Manager that will use a strong foundation and understanding of cost accounting and project accounting principles to drive business process improvements. The selected person functions as a senior individual contributor and evaluates, proposes, and drives opportunities for improvements that impact domestic and international operations (supply chains, materials, and ser", "locationDescription": "Milpitas, CA", "id": 9164303, "jobPoster": {"headline": "Senior Engineering Recruiter at KLA-Tencor", "lastName": "E.", "id": "4nb5a_4fFC", "firstName": "Henry"}}, {"salary": "90k", "company": {"id": 2267, "name": "The Mergis Group"}, "id": 9268328, "descriptionSnippet": "Current Need Manage the oversight of pension and postretirement accounts. Responsible for the monthly reporting, analysis of financial statements, and monthly/quarterly close activities, including balancing the books periodically and prepares profit and loss, cash flow, and balance sheet statements Prepare journal entries, maintains and reconciles ledger accounts.  Provide record of assets, liabil", "jobPoster": {"headline": "Recruiting and Placing the Nations Top Talent with Fortune 500 Companies", "lastName": "D.", "id": "gVEFDeThU2", "firstName": "Ashley"}, "locationDescription": "San Francisco, CA"}, {"company": {"id": 375420, "name": "Connor Group"}, "descriptionSnippet": "Job Title – Technical accounting Senior Manager/Manager   Job Description:   The Senior Manager/Manager of Technical Accounting is a critical position through which Connor Group adds value to their clients.  The Senior Manager/Manager will take direction and learn from the directors and partners by preparing our clients for an IPO, M&amp;A transaction or an audit. You will be involved with various", "locationDescription": "San Francisco Bay Area", "id": 7448339, "jobPoster": {"headline": "Partner - Staffing and Permanent Placement at Connor Group", "lastName": "W.", "id": "7ba6GfXjtY", "firstName": "Jared"}}, {"company": {"id": 1550, "name": "Kaiser Permanente"}, "descriptionSnippet": "Description POSITION TITLE REVISED TO: EXECUTIVE DIRECTOR, TECHNICAL ACCOUNTING  Key financial executive responsible for providing leadership in: ensuring compliance throughout KFH/HP and subsidiaries with, and monitoring developments in, National Association of Insurance Commissioners (NAIC) statutory accounting and reporting requirements; establishing and maintaining consistency in application o", "locationDescription": "California-Oakland", "id": 6686609, "jobPoster": {"headline": "Executive Finance Recruiter at Kaiser Permanente", "lastName": "(.", "id": "Z0z0enkFOy", "firstName": "TRICIA THOMAS-HORAN"}}, {"salary": "$70,000-$100,000", "company": {"id": 1087169, "name": "Parker and Lynch"}, "id": 9286460, "descriptionSnippet": "The Accounting Manager position is a critical role for our client, and is responsible for providing technical accounting expertise, financial analyses, and improvement of financial processes and controls.  The Accounting Manager is a key member of the Finance team and participates in many important aspects of the financial operations of the Company.    The Accounting Manager position is a critical", "jobPoster": {"headline": "Executive Recruiter at Parker & Lynch", "lastName": "G.", "id": "2lbQMA03y0", "firstName": "Jennifer"}, "locationDescription": "San Francisco Bay Area"}, {"company": {"id": 3676, "name": "Franklin Templeton Investments"}, "descriptionSnippet": "The Sr. Manager/Manager, Corporate Treasury Accounting is responsible for assisting the Director of Corporate Treasury Accounting with overseeing the accounting function of the Corporate Treasury Center, ensuring that monthly deadlines are met and that accurate and complete accounting records are produced.  In addition, he/she is responsible for overseeing the preparation of periodic internal and ", "locationDescription": "San Mateo, CA", "id": 9208149, "jobPoster": {"headline": "Talent Acquisition Lead at Franklin Templeton Investments", "lastName": "W.", "id": "re_eYm4eqM", "firstName": "Kelly"}}, {"company": {"id": 696014, "name": "Tell Apart"}, "descriptionSnippet": "Accounting ManagerTellApart helps many of the world's most successful retailers unlock the power of their customer data by applying the latest advances in cloud computing, predictive analytics, and machine learning. Our Customer Data Platform collects and analyzes massive amounts of data to power an integrated suite of marketing solutions that delivers personalized shopping experiences for 100s of", "locationDescription": "Burlingame, California", "id": 9141180, "jobPoster": {"headline": "Recruiting Manager at TellApart (We're Hiring!!!!)", "lastName": "D.", "id": "e3d6BFDnLM", "firstName": "John"}}, {"company": {"id": 846888, "name": "Spring Search Group"}, "descriptionSnippet": "Summary of Role The Director of Technical Accounting &amp; Reporting is responsible for external / internal reporting, the oversight of the close process, maintaining technical accounting policies, and evaluating / documenting new technical accounting matters.  The Director will also work closely with preparation of S-1 filing and, thereafter, be responsible for all SEC filings. On an ongoing basi", "locationDescription": "San Bruno, CA", "id": 7153831, "jobPoster": {"headline": "Executive Recruiter, Founder at Spring Search Group", "lastName": "B.", "id": "A-UWeVT7vj", "firstName": "Jeanmarie"}}, {"company": {"id": 163993, "name": "Gilead Sciences"}, "descriptionSnippet": "The Senior Technical Accountant will play a critical role in carrying out important initiatives of the Corporate Accounting team as well as assisting in other important processes such as technical accounting research, contract review, external reporting, Sarbanes-Oxley preparedness and compliance. Responsibilities: Technical Accounting - Provides timely technical support and guidance on significan", "locationDescription": "San Francisco Bay Area", "id": 9124661, "jobPoster": {"headline": "Talent Aquisition at Gilead at CT Talent Group Inc", "lastName": "T.", "id": "pN03ajGhek", "firstName": "Christy"}}, {"company": {"id": 375420, "name": "Connor Group"}, "descriptionSnippet": "As a key contributor to our engagement teams, you will apply your educational background and the experience obtained from public accounting to some of the most exciting clients in the world. You will take direction from other, more experienced members of the team as you assist in problem solving and adding value by preparing our clients with an IPO, M&amp;A transaction or an audit. You will be inv", "locationDescription": "Palo Alto", "id": 7467930, "jobPoster": {"headline": "Dir Business Development Connor Group", "lastName": "B.", "id": "RFVO-Snuwv", "firstName": "Markham"}}, {"company": {"id": 375420, "name": "Connor Group"}, "descriptionSnippet": "Job Title – Senior/Staff   Job Description:   As a key contributor to our engagement teams, you will apply your educational background and the experience obtained from public accounting to some of the most exciting clients in the world. You will take direction from other, more experienced members of the team as you assist in problem solving and adding value by preparing our clients with an IPO, M&", "locationDescription": "San Francisco Bay Area", "id": 7448269, "jobPoster": {"headline": "Partner - Staffing and Permanent Placement at Connor Group", "lastName": "W.", "id": "7ba6GfXjtY", "firstName": "Jared"}}, {"company": {"id": 4328, "name": "Logitech"}, "descriptionSnippet": "The Role:The Senior Manager of Technical Accounting and Reporting is responsible for:Support the Director of Accounting, as the Company’s subject matter expert on accounting issues for both existing and new FASB and IASB accounting standards.Research new accounting guidance from the FASB, IASB, SEC and other regulatory bodies, including evaluating the impact of new guidance on the Company’s financ", "locationDescription": "Newark, CA", "id": 7469805, "jobPoster": {"headline": "Lead Recruiter at Logitech", "lastName": "Muller", "id": "scIr6tGikc", "firstName": "Wendy"}}, {"company": {"id": 162533, "name": "Aruba Networks"}, "descriptionSnippet": "As part of the SEC Reporting/Technical Accounting group, the Senior Analyst will work under the direction and supervision of the SEC Reporting/Technical Accounting Senior Manager to assist in external reporting including Form 8-Ks, Form 10-K/10-Q. This position will interact with external auditors and work across many other Aruba functional groups, including GL, Revenue, FP&amp;A, and finance team", "locationDescription": "San Francisco Bay Area", "id": 6513323, "jobPoster": {"headline": "Hiring Top Talent to Drive Business Success! Follow the Leader @ArubaNetworks!", "lastName": "S.", "id": "L2nt9ybvg4", "firstName": "Steven"}}, {"salary": "$100,000 - $150,000", "company": {"id": 140734, "name": "BVOH"}, "id": 9359940, "descriptionSnippet": "Are you a CPA with previous experience in public accounting, including public company audits? Do you have strong operational experience and previous experience in the accounting department of a large company? Do you want to work for an exciting, fast paced pre- IPO company? If so, this could be the perfect opportunity for you! Our Client, a fast growing internet company located in the heart of San", "jobPoster": {"headline": "Finance & Accounting Recruiter at BVOH", "lastName": "K.", "id": "_gM5vXgldg", "firstName": "Sophia"}, "locationDescription": "San Francisco"}, {"company": {"id": 10667, "name": "Facebook"}, "descriptionSnippet": "Facebook is seeking a Manager, Technical Accounting. This position is full-time and located in our Menlo Park, CA headquarters.Responsibilities Monitor the activities of all accounting standard setting bodies to ensure timely identification of emerging accounting pronouncements  lead the quarterly GAAP and SEC updates with the Chief Accounting Officer.  Understand and provide interpretation of new", "locationDescription": "Menlo Park, CA", "id": 7268990, "jobPoster": {"headline": "Think it. Build it. Ship it.", "lastName": "C.", "id": "6Lh6EIwtb5", "firstName": "Samara"}}, {"company": {"id": 165949, "name": "Shutterfly"}, "descriptionSnippet": "Shutterfly is recruiting a Manager of Technical Accounting and External Reporting.  This position is a key member of the Financial Accounting / SEC Reporting team at Shutterfly, and will assist in all technical accounting research and its application to both internal and external reporting.  This position offers the successful applicant the opportunity to leverage an extensive background of techni", "locationDescription": "Redwood Shores, CA", "id": 9159622, "jobPoster": {"headline": "Recruiter at Shutterfly (mgutierrez@shutterfly.com)", "lastName": "Gutierrez", "id": "l_EEpaJlTC", "firstName": "Marcy"}}, {"company": {"id": 27409, "name": "SelectQuote Insurance Services"}, "descriptionSnippet": "Take your finance career to the next level as an Accounting Manager with SelectQuote Insurance Services. We are looking for an experienced Accounting Manager to join our team. In this position you'll manage a team of accountants in all operations, in accordance with U.S. GAAP and provide guidance, training, and mentoring to the accounting staff. This is the opportunity for you to leverage your sea", "locationDescription": "San Francisco Bay Area", "id": 9125613, "jobPoster": {"headline": "Associate", "lastName": "V.", "id": "ZwQq6EVo79", "firstName": "Severin"}}, {"company": {"name": "C3 Energy, Inc."}, "descriptionSnippet": "The Senior Accountant / Accounting Manager is an individual contributor responsible for key accounting areas overseeing the day to day accounting operational activities and related systems.  The Senior Accountant / Accounting Manager position is an individual contributor who will make an immediate difference.  Significant daily contribution, a mentor to other team members, team player, and profess", "locationDescription": "San Francisco Bay Area", "id": 9376563, "jobPoster": {"headline": "Human Resources Director at C3 Energy Network", "lastName": "B.", "id": "EqMpGddNBD", "firstName": "Lynn"}}, {"company": {"id": 140734, "name": "BVOH"}, "descriptionSnippet": "Are you a CPA with experience managing international accounting issues with a background in Private Accounting? Do you want to work for a very high-growth, fast paced company with a fantastic company culture? If so, this could be the perfect opportunity for you! Our Client, a rapidly growing start-up company located in the heart of San Francisco is currently seeking a highly competent accounting p", "locationDescription": "San Francisco", "id": 9363154, "jobPoster": {"headline": "Finance & Accounting Recruiter at BVOH", "lastName": "K.", "id": "_gM5vXgldg", "firstName": "Sophia"}}]}}