{"numResults": 25813, "facets": {"_total": 1, "values": [{"buckets": {"_total": 11, "values": [{"count": 1893, "selected": false, "code": "1073", "name": "EY"}, {"count": 508, "selected": false, "code": "1038", "name": "Deloitte"}, {"count": 501, "selected": false, "code": "3743", "name": "McGladrey"}, {"count": 497, "selected": false, "code": "1767", "name": "State Street"}, {"count": 496, "selected": false, "code": "1226", "name": "Army National Guard"}, {"count": 391, "selected": false, "code": "1351", "name": "Morgan Stanley Wealth Management"}, {"count": 365, "selected": false, "code": "1079", "name": "KPMG US"}, {"count": 329, "selected": false, "code": "1009", "name": "IBM"}, {"count": 261, "selected": false, "code": "1103", "name": "Verizon"}, {"count": 245, "selected": false, "code": "1067", "name": "J.P. Morgan"}, {"count": 210, "selected": false, "code": "3486", "name": "Hays"}]}, "code": "company", "name": "Company"}]}, "jobs": {"_total": 25813, "_count": 20, "_start": 20, "values": [{"salary": "$110,000-$125,000, plus bonus and equity", "company": {"id": 1087169, "name": "Parker and Lynch"}, "id": 9345671, "descriptionSnippet": "Accounting Manager   Compensation:   $110-$120k, plus bonus and Pre-IPO equity   Description:  The Technical Accounting &amp; Revenue Manager will actively lead technical accounting matters to ensure compliance with US GAAP and work to structure transactions to achieve the goals of the organization.  He/she will build best practice infrastructure to educate business unit owners and business unit c", "jobPoster": {"lastName": "private", "id": "private", "firstName": "private"}, "locationDescription": "San Francisco, CA"}, {"company": {"id": 7938, "name": "Wize Commerce"}, "descriptionSnippet": "This is an exciting opportunity to join our dynamic Accounting team in a leadership position. This position will own general Accounting Operations and a variety of special global and domestic projects.  He/She will drive improvements in an accounting function in a fast-pace environment with a company in a growing E-commerce market.    Reporting to the Senior Controller, the successful candidate wi", "locationDescription": "San Francisco Bay Area", "id": 9179619, "jobPoster": {"headline": "Recruiter at Wize Commerce", "lastName": "P.", "id": "LxzIhCnidH", "firstName": "Karena"}}, {"company": {"id": 675562, "name": "Square"}, "descriptionSnippet": "The Senior Manager of Financial Reporting and Technical Accounting will be a key member and leading the function to ensure the company’s compliance with all technical accounting and financial reporting requirements. The primary responsibility of this role is the development and management of the external reporting process including all required technical accounting support. He or she will also be ", "locationDescription": "San Francisco", "id": 6902629, "jobPoster": {"headline": "Recruiting  at Square Inc.", "lastName": "Lenhard", "id": "mI4ifMgGdR", "firstName": "Chuck"}}, {"company": {"id": 4192, "name": "Walmart eCommerce"}, "descriptionSnippet": "The Senior Manager, Accounting Policy & Controls will be responsible for determining the appropriate/required accounting treatment for all new financial transactions related to eCommerce. \r\n\r\nThe Senior Manager must possess significant business acumen to understand business initiatives and their respective impact to accounting and controls. The Senior Manager will be required to perform all necess", "locationDescription": "San Bruno ", "id": 7199753, "jobPoster": {"headline": "Senior Recruiter at Walmart eCommerce", "lastName": "Gonzalez", "id": "6kucl5BAKB", "firstName": "Laura"}}, {"salary": "Market", "company": {"id": 167892, "name": "YuMe"}, "id": 6949915, "descriptionSnippet": "SENIOR TAX ACCOUNTING MANAGER   Want to work in a dynamic environment at the intersection of technology and creativity? Join the team that is revolutionizing television brand advertising across PCs, smartphones, tablets, set-top boxes, game consoles, Internet-connected TVs and other devices. As a member of the Finance team, this position is responsible for managing the tax accounting, reporting an", "jobPoster": {"headline": "Director of Staffing @ YuMe", "lastName": "N.", "id": "li5gysK3we", "firstName": "Richard"}, "locationDescription": "Redwood City, Ca"}, {"company": {"id": 1441, "name": "Google"}, "descriptionSnippet": "Google accountants are a savvy bunch who handle the core accounting responsibilities at Google. As a member of this team, you know your accounting principles and the full accounting process end to end. You'll advise on financial reports required by governmental regulations, and you'll review, analyze, and interpret financial and budgetary reports -- and all this sounds like fun to you. Every day i", "locationDescription": "Mountain View, CA, USA", "id": 9321731, "jobPoster": {"headline": "Technologist at Enigma Associates", "lastName": "Z.", "id": "yRMde3thAW", "firstName": "David"}}, {"company": {"id": 7796, "name": "Riverbed Technology"}, "descriptionSnippet": "Accounting ManagerLocation: San Francisco, CARiverbed is about changing the rules. Forget about how things work today – join us as we solve the problems of the future. Do you thrive on change? Do you like the constant challenge of the new? Do you value simplicity? Our intelligent insights and hard work makes things easy for our customers so we can enable them to serve their customers. Can you help", "locationDescription": "San Francisco", "id": 9177422, "jobPoster": {"headline": "Director, Corporate Recruiting at Riverbed Technology", "lastName": "R.", "id": "OirWZB3IBm", "firstName": "Britt"}}, {"company": {"id": 26381, "name": "Procera Networks"}, "descriptionSnippet": "We are looking for a highly motivated Revenue/Technical Accounting Manager to play a key role within the company’s Finance function. This highly visible position will be a focal point for ensuring the accurate reporting of revenue and accounting data, the completeness and accuracy of SEC filings, technical accounting research and the sufficiency of the Company’s accounting policies.  The position ", "locationDescription": "Fremont, CA", "id": 7094159, "jobPoster": {"lastName": "private", "id": "private", "firstName": "private"}}, {"company": {"id": 1073, "name": "EY"}, "descriptionSnippet": "Within Ernst &amp; Young's Assurance service line, Financial Accounting Advisiry Services (FAAS) professionals provide advisory services encompassing accounting and regulatory support on accounting change and special matters; accounting processes and controls support (remediation, long-term contract accounting and cost accounting); GAAP conversion and implementation; IPO and other public offering ", "locationDescription": "San Francisco - California - US", "id": 9350083, "jobPoster": {"headline": "Technologist at Enigma Associates", "lastName": "Z.", "id": "yRMde3thAW", "firstName": "David"}}, {"company": {"id": 162479, "name": "Apple"}, "descriptionSnippet": "Team up with Apple, one of the most influential technology leaders in the industry. Join the Apple Finance organization and make a positive impact on a company that is known for its impressive lineup of products, including Mac, iPod, iPhone, iPad and iTunes. At Apple, you’ll share in a commitment to excellence by partnering with world-class managers, all with one unified vision—creating innovative", "locationDescription": "Santa Clara Valley - California  -US", "id": 7565662, "jobPoster": {"headline": "Technologist at Enigma Associates", "lastName": "Z.", "id": "yRMde3thAW", "firstName": "David"}}, {"company": {"id": 22688, "name": "Atlassian"}, "descriptionSnippet": "The Director, Technical Accounting &amp; Financial Reporting will contribute toward the development of a world-class technical accounting and financial reporting function, including identifying best practices, formalizing processes, standardizing documentation and partnering with various business functions to deliver timely and accurate information. Reporting to the Corporate Controller, the succe", "locationDescription": "San Francisco Bay Area", "id": 5659597, "jobPoster": {"headline": "Recruiting Lead at Atlassian", "lastName": "Delcambre", "id": "JYieaUT2JH", "firstName": "Michelle"}}, {"company": {"id": 626240, "name": "AdRoll"}, "descriptionSnippet": "AdRoll is seeking a proven and collaborative Accounting Manager to help the company scale its finance operations and “own” the GL. This is a great opportunity for an experienced accounting lead eager to help build a best-in class accounting environment from scratch. As a key member of the finance team you will help us in designing best practices, internal controls, an efficient month-end close pro", "locationDescription": "San Francisco ", "id": 9143215, "jobPoster": {"headline": "Recruiting Coordinator at AdRoll", "lastName": "P.", "id": "RWOUIJSsvo", "firstName": "Janine"}}, {"company": {"id": 4303, "name": "EFI"}, "descriptionSnippet": "[Are you looking for a career in a challenging and creative work environment at a company with award-winning technology? Are you looking for a company that values and recognizes your contributions and encourages you to shape your own career path? ]   Are you looking for a career in a challenging and creative work environment at a company with award-winning technology? Are you looking for a company", "locationDescription": "Fremont, CA", "id": 9149571, "jobPoster": {"headline": "Hiring Brilliant Minds to Engineer the Impossible", "lastName": "Sykes-Lague", "id": "H2mMQXFQ2w", "firstName": "Wendy"}}, {"company": {"id": 4192, "name": "Walmart eCommerce"}, "descriptionSnippet": "Walmart e-commerce is a fast paced, dynamic, high-tech division of Walmart. Our Inventory Accounting team is searching for a talented Senior Accountant to support the month end close process and monthly accounting and analysis activities. This includes but is not limited to: analyzing and determining the accuracy of the data as it flows through the various systems (such as SAP, OMS, WMS) and repor", "locationDescription": "San Bruno", "id": 7227321, "jobPoster": {"headline": "Senior Recruiter at Walmart eCommerce", "lastName": "Gonzalez", "id": "6kucl5BAKB", "firstName": "Laura"}}, {"company": {"id": 163993, "name": "Gilead Sciences"}, "descriptionSnippet": "The Senior Manager, Technical Accounting oversees the accounting and reporting for strategic transactions (e.g. business combinations, debt issuance/settlements). He/she oversees preparation and maintenance of clear and accurate US GAAP accounting policies utilized by all of Gilead’s subsidiaries worldwide. He/she is a key advisor on US GAAP matters and partners with the various finance groups to ", "locationDescription": "San Francisco Bay Area", "id": 9124650, "jobPoster": {"headline": "Talent Aquisition at Gilead at CT Talent Group Inc", "lastName": "T.", "id": "pN03ajGhek", "firstName": "Christy"}}, {"salary": "Market", "company": {"id": 167892, "name": "YuMe"}, "id": 9124050, "descriptionSnippet": "Are you ready to take your career to the next level?  Here at YuMe, we are!!!  With our recent IPO and a video advertising market that is expected to continue its rapid growth, YuMe is in a fantastic position to take advantage of this critical opportunity as the leader in the space.   Come join us as we make this vision a reality.   As a member of YuMe’s Corporate Accounting team, this position is", "jobPoster": {"headline": "Director of Staffing @ YuMe", "lastName": "N.", "id": "li5gysK3we", "firstName": "Richard"}, "locationDescription": "Redwood City, CA right next to Caltrain"}, {"company": {"id": 10667, "name": "Facebook"}, "descriptionSnippet": "Facebook is seeking to fill a full-time position of an Associate Manager, Infrastructure Accounting. In this specific role, you will join a team that manages the financial reporting for one of Facebook’s largest investments that helps connect more than a billion users. The successful candidate will be on the team responsible for the accounting of Facebook’s investment of infrastructure fixed asset", "locationDescription": "Menlo Park, CA", "id": 7164846, "jobPoster": {"headline": "Think it. Build it. Ship it.", "lastName": "C.", "id": "6Lh6EIwtb5", "firstName": "Samara"}}, {"salary": "Attractive base plus bonuses/incentives", "company": {"id": 166408, "name": "The Siegfried Group"}, "id": 5819747, "descriptionSnippet": "The best and the brightest always have choices in the Accounting &amp; Finance industry.   We want you to view your time with Siegfried as an investment in your future that pays dividends along the way. The longer you stay with Siegfried the wider breadth of Accounting &amp; Finance opportunities and experiences you will gain.   No two career paths at Siegfried look the same.   Apply now to start ", "jobPoster": {"headline": "National Director of Recruiting & Employee Development", "lastName": "S.", "id": "lCdN134t3I", "firstName": "Melissa"}, "locationDescription": "San Francisco Bay Area"}, {"company": {"id": 165158, "name": "Netflix"}, "descriptionSnippet": "As Netflix continues to grow streaming video domestically and expand internationally we are encountering increased operational complexities and challenges in our Procure-to-Pay process and accounting infrastructure. We need to work with business partners internally and externally to design processes and establish best practices that achieve:- Economic efficiency- Maximum automation and Scalability", "locationDescription": "Los Gatos, CA", "id": 9367625, "jobPoster": {"headline": "Staffing Operations at Netflix Inc.", "lastName": "Mehta", "id": "rA3Km6tyxe", "firstName": "Chetna"}}, {"company": {"id": 163993, "name": "Gilead Sciences"}, "descriptionSnippet": "The Accounting and Compliance Manager will be responsible for AP accounting and general compliance issues including, monthly and quarterly financial close cycles, 1099 and 1042 reporting, SOx controls, master vendor data compliance, drafting and review of AP policies and procedures. This position will report to the Sr. Manager Procure to Pay (PTP) Operations, and will manage a staff of 2 to 3 full", "locationDescription": "San Francisco Bay Area", "id": 9342441, "jobPoster": {"headline": "Talent Aquisition at Gilead at CT Talent Group Inc", "lastName": "T.", "id": "pN03ajGhek", "firstName": "Christy"}}]}}