{"numResults": 9295, "facets": {"_total": 1, "values": [{"buckets": {"_total": 11, "values": [{"count": 273, "selected": false, "code": "1067", "name": "J.P. Morgan"}, {"count": 253, "selected": false, "code": "1068", "name": "JPMorgan Chase"}, {"count": 200, "selected": false, "code": "497017", "name": "Morgan Stanley"}, {"count": 199, "selected": false, "code": "163001", "name": "Chase"}, {"count": 162, "selected": false, "code": "1103", "name": "Verizon"}, {"count": 158, "selected": false, "code": "1419", "name": "Capital One"}, {"count": 155, "selected": false, "code": "1038", "name": "Deloitte"}, {"count": 150, "selected": false, "code": "1441", "name": "Google"}, {"count": 135, "selected": false, "code": "1767", "name": "State Street"}, {"count": 91, "selected": false, "code": "3486", "name": "Hays"}, {"count": 87, "selected": false, "code": "1009", "name": "IBM"}]}, "code": "company", "name": "Company"}]}, "jobs": {"_total": 9295, "_count": 10, "_start": 40, "values": [{"company": {"id": 157326, "name": "Bank of the West"}, "descriptionSnippet": "What sets Bank of the West apart from other banks is our team members–they embody the optimistic spirit of the West.  There is a spirit here that drives us to do more.  Our team of more than 10,000 employees is vital to the success of our Bank.  They reflect our modern western values—straightforward, entrepreneurial and optimistic.  We seek to create a corporate culture that fosters and rewards ex", "locationDescription": "San Francisco Bay Area", "id": 9252604, "jobPoster": {"headline": "Talent Acquisition Lead Recruiter, VP at Bank of the West", "lastName": "P.", "id": "QnKQxPlJXj", "firstName": "Rona"}}, {"company": {"id": 35710, "name": "Blurb"}, "descriptionSnippet": "Position Summary: The Senior Financial Analyst plays a key role in providing financial insights and business decision-making support as well as driving process improvements and day-to-day analytical and forecasting support for the company. The candidate will report directly to the Director, FP&amp;A and support the company’s overall financial reporting, long-range planning and expense management a", "locationDescription": "San Francisco Bay Area", "id": 9323058, "jobPoster": {"headline": "In House Recruiter", "lastName": "N.", "id": "9X_vrA-xpl", "firstName": "Alissa"}}, {"company": {"id": 9438, "name": "TriNet"}, "descriptionSnippet": "The Senior Financial Analyst is responsible for efficiently providing detailed analytical support to senior management to improve business performance.  The person in this position provides financial and operational analytics, budgeting and forecasting, trend analysis, business insights, qualitative assessment of risks and opportunities, and recommendations based on advanced financial analysis. Se", "locationDescription": "San Leandro, US-CA", "id": 9306340, "jobPoster": {"headline": "Senior Corporate Recruiter at TriNet", "lastName": "H.", "id": "HaG_dcNwzV", "firstName": "Aubrey"}}, {"company": {"id": 4192, "name": "Walmart eCommerce"}, "descriptionSnippet": "Walmart.com is seeking a Senior Financial Analyst who will support our finance serior management. Main responsibilities include budgeting, reporting, forecasting and analyses in support of the business identifying opportunities and risk, and more importantly, driving business results. Candidates will be expected to utilize their accounting and financial background to provide financial advice to th", "locationDescription": "San Bruno ", "id": 9197077, "jobPoster": {"headline": "Senior Recruiter at Walmart eCommerce", "lastName": "Gonzalez", "id": "6kucl5BAKB", "firstName": "Laura"}}, {"company": {"id": 3420, "name": "TIBCO Software Inc."}, "descriptionSnippet": "This position requires an energetic individual with a demonstrated ability to make key contributions in the analysis of financial and strategic issues within the Corporate Marketing Team.  The Sr. Financial Analyst will provide financial budgeting &amp; forecasting, managerial reporting, business metrics &amp; drivers, and assistance with other ad-hoc projects.  Reporting to the Director of FP&amp", "locationDescription": "Palo Alto, CA", "id": 7570986, "jobPoster": {"headline": "Manager, Staffing at TIBCO Software Inc.", "lastName": "Greenawalt", "id": "6DZJ48nKQ1", "firstName": "Lisa"}}, {"company": {"id": 2190, "name": "Visa"}, "descriptionSnippet": "Visa Inc. is a global payments technology company that connects consumers, businesses, financial institutions and governments in more than 200 countries and territories, enabling them to use digital currency instead of cash and checks. Visa does not issue cards, extend credit or set rates and fees for consumers. Visa’s innovations enable its bank customers to offer consumers choices: Pay now with ", "locationDescription": "US-CA-Foster City", "id": 7555676, "jobPoster": {"lastName": "private", "id": "private", "firstName": "private"}}, {"company": {"id": 1441, "name": "Google"}, "descriptionSnippet": "When it comes to evaluating a Mergers and Acquisitions opportunity, the M&amp;A Finance team plays a critical role in providing the tool kit for making sound business decisions. Working in close partnership with Legal, Corporate Development and People Operations, this team provides the financial analysis, forecasting and modeling to help decision-makers assess the strengths and risks involved in a", "locationDescription": "Mountain View, CA, USA", "id": 6780465, "jobPoster": {"headline": "Technologist at Enigma Associates", "lastName": "Z.", "id": "yRMde3thAW", "firstName": "David"}}, {"company": {"id": 202760, "name": "GoodData"}, "descriptionSnippet": "We are looking for a Sr. Financial Analyst/Manager, passionate about driving strategic and operational improvements through Financial Planning &amp; Analysis at a well-funded hyper growth technology startup in Business Intelligence space. The ideal candidate will have a very strong analytical and Finance background with demonstrated ability to apply problem-solving skills in business context. In t", "locationDescription": "San Francisco, CA", "id": 7448457, "jobPoster": {"headline": "Experienced Staffing Consultant", "lastName": "R.", "id": "-ZOEfdmBWx", "firstName": "Laura"}}, {"company": {"id": 1602, "name": "Roche"}, "descriptionSnippet": "The Sr. Financial Analyst has ownership of business partner relationships with Lifecycle Leaders and their teams.  This individual will partner with different functional groups (Marketing, Pricing &amp; HECON, Project Management, Research, Development, Operations, and Medical Affairs) to deliver information that enables a thorough understanding of project costs and product expectations.  This incl", "locationDescription": "Pleasanton, US-CA", "id": 9141861, "jobPoster": {"headline": "Social Media Recruiting, Talent Pipeline Building, careers.roche.com at Roche", "lastName": "B.", "id": "xOpYNlZAGW", "firstName": "Gabor"}}, {"company": {"name": "Fairn & Swanson In."}, "descriptionSnippet": "The Inventory/Financial Analyst is responsible for the following job duties, as well as additional responsibilities not listed as assigned:   Provide central point of contact for the coordination of all F&amp;S’s warehouse inventory activities Enterprise Resource Planning (ERP) software updates, training, and support to users Extract  and analyze data from database and make appropriate recommendat", "locationDescription": "San Francisco Bay Area", "id": 7570678, "jobPoster": {"headline": "Human Resources Professional", "lastName": "K.", "id": "8keKCSwDko", "firstName": "Irene"}}]}}