{"numResults": 1350, "facets": {"_total": 1, "values": [{"buckets": {"_total": 11, "values": [{"count": 253, "selected": false, "code": "1068", "name": "JPMorgan Chase"}, {"count": 199, "selected": false, "code": "163001", "name": "Chase"}, {"count": 151, "selected": false, "code": "1067", "name": "J.P. Morgan"}, {"count": 55, "selected": false, "code": "497017", "name": "Morgan Stanley"}, {"count": 25, "selected": false, "code": "11448", "name": "Citi"}, {"count": 23, "selected": false, "code": "1382", "name": "Goldman Sachs"}, {"count": 23, "selected": false, "code": "1808", "name": "RBC"}, {"count": 20, "selected": false, "code": "1426", "name": "Barclays"}, {"count": 13, "selected": false, "code": "1284", "name": "Credit Suisse"}, {"count": 13, "selected": false, "code": "3537", "name": "Macquarie Group"}, {"count": 10, "selected": false, "code": "1767", "name": "State Street"}]}, "code": "company", "name": "Company"}]}, "jobs": {"_total": 1350, "_count": 20, "_start": 20, "values": [{"company": {"id": 157326, "name": "Bank of the West"}, "descriptionSnippet": "What sets Bank of the West apart from other banks is our team members–they embody the optimistic spirit of the West. There is a spirit here that drives us to do more. Our team of more than 10,000 employees is vital to the success of our Bank. They reflect our modern western values—straightforward, entrepreneurial and optimistic. We seek to create a corporate culture that fosters and rewards excell", "locationDescription": "San Francisco Bay Area", "id": 7556015, "jobPoster": {"headline": "Sr. Technology Recruiter at Bank of the West", "lastName": "B.", "id": "4DXxaqohHH", "firstName": "Iris"}}, {"company": {"id": 157326, "name": "Bank of the West"}, "descriptionSnippet": "What sets Bank of the West apart from other banks is our team members–they embody the optimistic spirit of the West.  There is a spirit here that drives us to do more.  Our team of more than 10,000 employees is vital to the success of our Bank.  They reflect our modern western values—straightforward, entrepreneurial and optimistic.  We seek to create a corporate culture that fosters and rewards ex", "locationDescription": "San Francisco Bay Area", "id": 9252604, "jobPoster": {"headline": "Talent Acquisition Lead Recruiter, VP at Bank of the West", "lastName": "P.", "id": "QnKQxPlJXj", "firstName": "Rona"}}, {"company": {"id": 157326, "name": "Bank of the West"}, "descriptionSnippet": "Requirements New opportunity for a CCAR Project Manager! This role is responsible for the project oversight of the Risk Management Modeling for Forecasting and Stress Testing program including the planning and managing as well as incorporating best practices into the process. This role sits in the Risk Management organization and reports into the Risk Program Manager. Responsible for managing the ", "locationDescription": "San Francisco Bay Area", "id": 9284222, "jobPoster": {"headline": "Vice President, Executive Recruiter at Bank of the West (BNP Paribas)", "lastName": "W.", "id": "1sWFU1hgyo", "firstName": "Joel"}}, {"company": {"id": 497017, "name": "Morgan Stanley"}, "descriptionSnippet": "Morgan Stanley’s Public Finance Investment Banking Group raises capital to fund projects for public sector entities and not-for-profit institutions. The Group plans financial strategies and structures tax-exempt and taxable offerings along with derivative solutions to meet the needs of state and local governments, hospitals and health care organizations, higher education and cultural institutions,", "locationDescription": "San Francisco, CA", "id": 9209331, "jobPoster": {"headline": "Recruiting Business Analyst", "lastName": "W.", "id": "rYXtf0GTN0", "firstName": "Melissa"}}, {"company": {"id": 163001, "name": "Chase"}, "descriptionSnippet": "Chase is a leader in the financial services industry, providing banking, mortgages, credit cards, loans, payment processing and investment services to 50 million customers - 1 out of every 6 Americans. As a division of JPMorgan Chase &amp; Co. (NYSE:JPM), we:  serve 21 million households with consumer banking relationships lent $17 billion to small businesses in 2011 are one of the nation's larges", "locationDescription": "US-CA-San Francisco", "id": 9197114, "jobPoster": {"headline": "Vice President of Career Development at JPMorgan Chase", "lastName": "W.", "id": "65aE3S8BpF", "firstName": "Kevin"}}, {"company": {"id": 157326, "name": "Bank of the West"}, "descriptionSnippet": "Requirements Risk Management Credit Strategies Manager Summary: Responsible for overseeing and developing strategic credit policies for managing the bank’s credit risk. Directs the execution of developed credit strategies and risk mitigation activities. Ensures proprietary models used to devise and initiate stress tests measure the impact of economic and other variables on the credit portfolios. R", "locationDescription": "San Francisco Bay Area", "id": 9284235, "jobPoster": {"headline": "Vice President, Executive Recruiter at Bank of the West (BNP Paribas)", "lastName": "W.", "id": "1sWFU1hgyo", "firstName": "Joel"}}, {"company": {"id": 157326, "name": "Bank of the West"}, "descriptionSnippet": "Summary: Responsible for and assist in designing and implementing retail segmentation models as part of an organization wide Implementation Program. Will also be involved in assessing available historical (default, loss given default and exposure at default) and risk factor data to support requirements and model development. Responsibilities: 1. Assist in the assessment of the number of retail seg", "locationDescription": "San Francisco Bay Area", "id": 9180106, "jobPoster": {"headline": "Vice President, Executive Recruiter at Bank of the West (BNP Paribas)", "lastName": "W.", "id": "1sWFU1hgyo", "firstName": "Joel"}}, {"company": {"id": 157326, "name": "Bank of the West"}, "descriptionSnippet": "Responsible for analysis of data to ensure integrity and quality, develop requirements for granularity, determine history requirements and timelines, and mapping rules. Documenting the business, data and functional requirements to support the development of certain PD, LGD and EAD models. The incumbent will collaborate with business, risk personnel and a model development team to deliver data and ", "locationDescription": "San Francisco Bay Area", "id": 9179348, "jobPoster": {"headline": "Vice President, Executive Recruiter at Bank of the West (BNP Paribas)", "lastName": "W.", "id": "1sWFU1hgyo", "firstName": "Joel"}}, {"company": {"id": 157326, "name": "Bank of the West"}, "descriptionSnippet": "Position Summary Responsible for analysis of data to ensure integrity and quality, develop requirements for granularity, determine history requirements and timelines, and mapping rules. Documenting the business, data and functional requirements to support the development of certain Basel II PD, LGD and EAD models. The incumbent will collaborate with business, risk personnel and a model development", "locationDescription": "San Francisco Bay Area", "id": 7227596, "jobPoster": {"headline": "Vice President, Executive Recruiter at Bank of the West (BNP Paribas)", "lastName": "W.", "id": "1sWFU1hgyo", "firstName": "Joel"}}, {"company": {"id": 9112, "name": "First Republic Bank"}, "descriptionSnippet": "First Republic Bank is looking for a talented Business System Analyst to join our Residential Lending Support team.  As a Lending Support Business Analyst, you will aid in compliance-driven modifications to and essential maintenance for the legacy residential loan origination system.  Further, you will be a key contributor in the evaluation, selection, and implementation of a new real estate loan ", "locationDescription": "San Francisco Bay Area", "id": 6588102, "jobPoster": {"headline": "Staffing Development Manager at First Republic Bank", "lastName": "B.", "id": "mC7JCG5pv_", "firstName": "Morgan"}}, {"company": {"id": 3051, "name": "Apollo Group"}, "descriptionSnippet": "Department Overview   We have a talented team of analysts, technologists and marketers who are pushing the boundaries of digital analytics. Following a recent business-wide implementation of Adobe/Omniture, we’re now in the position to expand the extent to which digital analytics data is consumed and used throughout the company. We’re seeking an expert to lead the charge in managing Apollo’s growi", "locationDescription": "San Francisco, CA", "id": 6784656, "jobPoster": {"headline": "Sr Technical Recruiter at Apollo Group  www.apollogrp.edu/careers", "lastName": "H.", "id": "DQ6CRrqLLv", "firstName": "Lisa"}}, {"salary": "Competitive", "company": {"name": "Confidential"}, "id": 7571138, "descriptionSnippet": "Client:   Our client is a private investment firm located in the Bay Area, which provides a variety of debt financing options to support recapitalizations, acquisitions, refinancing and minority growth investments, with a focus on technology companies.  They are currently seeking a Pre-MBA Associate for an immediate hire.   Responsibilities:   Evaluate and analyze potential investment opportunitie", "jobPoster": {"headline": "Managing Director at Pinnacle Group International", "lastName": "M.", "id": "9c4mlI4Eql", "firstName": "Brant"}, "locationDescription": "Bay Area, CA"}, {"company": {"id": 497017, "name": "Morgan Stanley"}, "descriptionSnippet": "Morgan Stanley is a global leader in wealth management with an extensive network of over 500 offices and 16,000 Financial Advisors around the world. Our Financial and Wealth Advisors deliver tailored solutions to fit individual investment objectives, risk tolerance and liquidity needs. We provide individuals, families, businesses and institutions with a wide variety of financial services: brokerag", "locationDescription": "US- CA - San Francisco", "id": 9126107, "jobPoster": {"headline": "Recruiting Business Analyst", "lastName": "W.", "id": "rYXtf0GTN0", "firstName": "Melissa"}}, {"company": {"id": 157326, "name": "Bank of the West"}, "descriptionSnippet": "Under general direction, responsible for evaluating and analyzing complex information to support projects and/or in overall management of a business unit/department. Develops and documents business requirements and/or solutions and leads efforts to solve problems and issues related to business operations. Responsibilities; 1. Advises and leads in the planning and implementation of projects and str", "locationDescription": "San Francisco Bay Area", "id": 7573849, "jobPoster": {"headline": "Talent Acquisition Lead Recruiter, VP at Bank of the West", "lastName": "P.", "id": "QnKQxPlJXj", "firstName": "Rona"}}, {"company": {"id": 4192, "name": "Walmart eCommerce"}, "descriptionSnippet": "The GeC Corporate Development team is responsible for advising business partners, leading strategic transaction execution (acquisitions, partnerships, joint ventures, etc.) and providing real-time business updates on competitive landscapes, industry events, and opportunities.  From time to time, the team will work on cross-functional projects with the M&A teams supporting Walmart stores.\r\n\r\nThe Se", "locationDescription": "San Francisco Bay Area", "id": 7227880, "jobPoster": {"headline": "Sr. Recruiter at Walmart eCommerce", "lastName": "DiStefano", "id": "MWr31ffvXy", "firstName": "Michelle"}}, {"company": {"id": 497017, "name": "Morgan Stanley"}, "descriptionSnippet": "Morgan Stanley’s Public Finance Investment Banking group raises capital to fund projects for public sector entities and not-for-profi t institutions. The group plans financial strategies and structures tax-exempt and taxable offerings along with derivative solutions to meet the needs of state and local governments, hospitals and health care organizations, higher education and cultural institutions", "locationDescription": "San Francisco, CA", "id": 7563774, "jobPoster": {"headline": "Recruiting Business Analyst", "lastName": "W.", "id": "rYXtf0GTN0", "firstName": "Melissa"}}, {"company": {"id": 4375, "name": "Union Bank"}, "descriptionSnippet": "Job Summary: Reporting to a senior manager within Enterprise Risk Reporting &amp; Analysis (ERRA), the Enterprise Risk Management (ERM) Analyst will advance the Bank’s Risk Management culture, structure, processes and tools in support of the bank’s Risk Vision. This position is part of a team of risk professionals responsible for supporting the Bank’s Enterprise Risk Management framework, which ma", "locationDescription": "San Francisco Bay Area", "id": 7369242, "jobPoster": {"headline": "Corporate Recruiter for Union Bank focused on finding outstanding talent to join our team!", "lastName": "H.", "id": "p0lGOLagoZ", "firstName": "Amanda"}}, {"company": {"id": 2190, "name": "Visa"}, "descriptionSnippet": "Visa Inc. is a global payments technology company that connects consumers, businesses, financial institutions and governments in more than 200 countries and territories, enabling them to use digital currency instead of cash and checks. Visa does not issue cards, extend credit or set rates and fees for consumers. Visa’s innovations enable its bank customers to offer consumers choices: Pay now with ", "locationDescription": "US-CA-Foster City", "id": 7555600, "jobPoster": {"lastName": "private", "id": "private", "firstName": "private"}}, {"company": {"id": 1441, "name": "Google"}, "descriptionSnippet": "Financial Analysts ensure that Google makes sound financial decisions. Our team of Financial Analysts foster the financial health of our organization by partnering closely with our various functions, tracking performance metrics and creating financial models. Our Financial Analysts are up to date with the latest economic trends and apply knowledge around rates of return, depreciations, working cap", "locationDescription": "Mountain View, CA, USA", "id": 9318878, "jobPoster": {"headline": "Technologist at Enigma Associates", "lastName": "Z.", "id": "yRMde3thAW", "firstName": "David"}}, {"company": {"id": 157326, "name": "Bank of the West"}, "descriptionSnippet": "Responsible for providing Quality Assurance services to projects, maintenance activities and taking ownership of the quality of multiple applications while conducting Quality Assurance development processes, developing test solutions, and assisting in the development, implementation, and maintenance of Quality Assurance best practices and testing standards. Analyzes business requirements for compl", "locationDescription": "San Francisco Bay Area", "id": 7573843, "jobPoster": {"headline": "Talent Acquisition Lead Recruiter, VP at Bank of the West", "lastName": "P.", "id": "QnKQxPlJXj", "firstName": "Rona"}}]}}