{"numResults": 1350, "facets": {"_total": 1, "values": [{"buckets": {"_total": 11, "values": [{"count": 253, "selected": false, "code": "1068", "name": "JPMorgan Chase"}, {"count": 199, "selected": false, "code": "163001", "name": "Chase"}, {"count": 151, "selected": false, "code": "1067", "name": "J.P. Morgan"}, {"count": 55, "selected": false, "code": "497017", "name": "Morgan Stanley"}, {"count": 25, "selected": false, "code": "11448", "name": "Citi"}, {"count": 23, "selected": false, "code": "1382", "name": "Goldman Sachs"}, {"count": 23, "selected": false, "code": "1808", "name": "RBC"}, {"count": 20, "selected": false, "code": "1426", "name": "Barclays"}, {"count": 13, "selected": false, "code": "1284", "name": "Credit Suisse"}, {"count": 13, "selected": false, "code": "3537", "name": "Macquarie Group"}, {"count": 10, "selected": false, "code": "1767", "name": "State Street"}]}, "code": "company", "name": "Company"}]}, "jobs": {"_total": 1350, "_count": 20, "_start": 0, "values": [{"company": {"id": 165477, "name": "Piper Jaffray"}, "descriptionSnippet": "About Piper Jaffray  Piper Jaffray is a leading, international middle-market investment bank serving the needs of middle market corporations, private equity groups, public entities and institutional investors. Headquartered in Minneapolis, Minnesota, the firm has additional investment banking offices in New York, San Francisco, Charlotte and London. Piper Jaffray investment banking specializes in ", "locationDescription": "San Francisco, CA", "id": 7356430, "jobPoster": {"headline": "Investment Banking Recruiter at Piper Jaffray", "lastName": "H.", "id": "SFebgDWGo_", "firstName": "Megan"}}, {"company": {"name": "RCS Capital Corp"}, "descriptionSnippet": "RCS Capital Corp (RCAP) is seeking to immediately hire several experienced analysts in our New York office to join our investment banking team. RCAP was the number two advisor of REIT M&amp;A transactions in 2012 and has advised on more than $19 billion of M&amp;A and capital markets transactions in the past 18 months.  RCAP’s affiliate, American Realty Capital, is a sponsor of public traded and n", "locationDescription": "Greater New York City Area", "id": 9122174, "jobPoster": {"headline": "Exec Asst to CEO / Director Human Resources at American Realty Capital", "lastName": "K.", "id": "b-yvEBPKgb", "firstName": "Anne"}}, {"company": {"id": 165477, "name": "Piper Jaffray"}, "descriptionSnippet": "Piper Jaffray Investment Banking Analyst Opportunity  About Piper Jaffray  Piper Jaffray is a leading, international middle-market investment bank and institutional securities firm, serving the needs of middle market corporations, private equity groups, public entities and institutional investors. Headquartered in Minneapolis, Minnesota, the firm has additional investment banking offices in New Yo", "locationDescription": "United States", "id": 7244971, "jobPoster": {"headline": "Investment Banking Recruiter at Piper Jaffray", "lastName": "H.", "id": "SFebgDWGo_", "firstName": "Megan"}}, {"company": {"id": 165477, "name": "Piper Jaffray"}, "descriptionSnippet": "About Piper Jaffray  Piper Jaffray is a leading, international middle-market investment bank serving the needs of middle market corporations, private equity groups, public entities and institutional investors. Headquartered in Minneapolis, Minnesota, the firm has additional investment banking offices in New York, San Francisco, and London. Piper Jaffray investment banking specializes in a variety ", "locationDescription": "Minneapolis, MN", "id": 6971357, "jobPoster": {"headline": "Investment Banking Recruiter at Piper Jaffray", "lastName": "H.", "id": "SFebgDWGo_", "firstName": "Megan"}}, {"company": {"id": 1852, "name": "Prudential"}, "descriptionSnippet": "Prudential Real Estate Investors (PREI) is the real estate investment management business of Prudential Financial. PREI is comprised of fund management centers in the US located in Madison, New Jersey, Atlanta, Chicago, New York and San Francisco. PREI has multiple global offices including: Munich, London, Singapore, Mexico City, Sao Paulo, Tokyo, and Hong Kong. PREI's specialized operating units ", "locationDescription": "San Francisco, US-CA", "id": 7458601, "jobPoster": {"headline": "Sr Recruiter at Prudential Financial", "lastName": "R.", "id": "gz6hgorsum", "firstName": "Cheray"}}, {"company": {"id": 85979, "name": "Silverwood Partners"}, "descriptionSnippet": "Silverwood Partners views the Analyst as a critical member of the transaction team and the Analyst will assume high levels of responsibility almost immediately. An Analyst assists senior bankers in advising clients on making acquisitions or divestitures, selling businesses or helping to strategically advise companies in obtaining private funding and executing private placement transactions. As one", "locationDescription": "Greater Boston Area", "id": 7549996, "jobPoster": {"headline": "Managing Director at Silverwood Partners and Owner, Silverwood Partners", "lastName": "M.", "id": "a42N2v2Ppd", "firstName": "Nicolas"}}, {"company": {"name": "Investment Banking Boutique"}, "descriptionSnippet": "Investment banking analyst/associate with 1-4 years of previous experience at a large bank or boutique required.  Responsibilities include financial modeling and corporate valuation but offers wide opportunities to add real value to deal teams and clients with very limited mid-level staffing.  Terrific opportunity for experienced junior banker committed to an investment banking but within a smalle", "locationDescription": "Greater New York City Area", "id": 9143646, "jobPoster": {"headline": "Managing Director at Investment Banking Boutique", "lastName": "P.", "id": "MoeDwPas8u", "firstName": "Peter M."}}, {"company": {"id": 7026, "name": "Duff & Phelps"}, "descriptionSnippet": "Join our team and together we'll power the sound decisions that enhance value - yours and ours. We are looking for Analysts to join our team during the summer of 2014. Responsibilities: Investment Banking Analysts will act as banking generalists, working as a part of our global investment banking team on a variety of engagements. Individuals will be assigned a wide variety of projects and given as", "locationDescription": "Chicago, IL", "id": 6969987, "jobPoster": {"headline": "Integrated Marketing Communication Specialist", "lastName": "P.", "id": "9Py7DgmT7z", "firstName": "Camille"}}, {"company": {"id": 36093, "name": "Headwaters MB"}, "descriptionSnippet": "Headwaters runs a rotating Investment Banking Analyst Internship program out its Denver Headquarters. Interns have a variety of responsibilities within the organization in the context of a 6-9 month program.  Interns work directly with the Director of Business Development, corporate management team and various industry practices to provide support on all aspects of executing merger and acquisition", "locationDescription": "Denver, CO", "id": 7128660, "jobPoster": {"headline": "Director of Business Development at Headwaters MB.", "lastName": "B.", "id": "Azguipr5EX", "firstName": "Brendan"}}, {"salary": "TBD", "company": {"id": 6893, "name": "Delta Dental"}, "id": 9178645, "descriptionSnippet": "This position is responsible for accounting for investments and banking activities, configuring and maintaining software platforms related to investments and banking, and for preparing investment analysis and reports.   Duties include: Configuration and Maintenance the Clearwater Analytics system: Ensure the accuracy of data in the enterprise’ system of record for investments (Clearwater Analytics", "jobPoster": {"headline": "Recruitment Manager at Delta Dental of CA", "lastName": "C.", "id": "AbB_-hQN5Y", "firstName": "Annette"}, "locationDescription": "San Francisco"}, {"company": {"id": 137582, "name": "Bank Street Group"}, "descriptionSnippet": "An Analyst with The Bank Street Group is involved in the execution of transactions across a variety of industries. Bank Street advises clients across various growth sectors including, but not limited to, the following:   In the Technology, Media and Telecom space, Bank Street advises clients in the following industry sub-sectors: Wireline, Wireless/Cellular, Managed Services, Hosted &amp; Cloud Se", "locationDescription": "Greater New York City Area", "id": 9144894, "jobPoster": {"headline": "Investment Banking Associate at Bank Street Group", "lastName": "P.", "id": "xYdF3FadcK", "firstName": "Kavi"}}, {"company": {"id": 54347, "name": "BCMS Corporate UK"}, "descriptionSnippet": "BCMS Corporate and its registered Broker Dealer, BCMS Capital Advisors, are a fast growing M&amp;A Advisory firm focused on advising lower middle market private companies and entrepreneurs. We are seeking a full-time Associate to assist senior bankers on sell-side transactions. The hire will be expected to assume significant deal responsibility from Day One.   The successful candidate will have pr", "locationDescription": "Dallas/Fort Worth Area", "id": 9125403, "jobPoster": {"headline": "Director, Operations - North America at BCMS Corporate", "lastName": "H.", "id": "GVAYI77x3k", "firstName": "Brian"}}, {"company": {"id": 1800, "name": "RBC Capital Markets"}, "descriptionSnippet": "City: New York  Address: 3WFC  Work Hours/Week: 40+  Work Environment: Office  Employment Type: Permanent  Pay Type: Salaried  Exempt/Non-Exempt: Exempt  % Travel Required: 0-25  People Manager: No  Job Posting End Date: 10/30/2013 PRIMARY RESPONSIBILITIESSome responsibilities include but are not limited to:• Analytical, due diligence and transactional support on workout, restructuring, LBO, acqui", "locationDescription": "New York, NY", "id": 9357197, "jobPoster": {"headline": "Recruitment All-Rounder.", "lastName": "L.", "id": "nCTw9spN0k", "firstName": "Yves"}}, {"company": {"id": 55970, "name": "Matthews International Capital Management"}, "descriptionSnippet": "We are currently recruiting Research Analysts for the following investment strategies: Matthews Japan Fund Matthews India Fund Matthews China Fund   REPORTING RELATIONSHIPS:   These positions will report to a lead Portfolio Manager of one of the company’s investment strategies.    ROLE AND RESPONSIBILITIES:   We are seeking individuals to join the Matthews’ teams to perform fundamental research an", "locationDescription": "Financial District", "id": 9344892, "jobPoster": {"headline": "Human Resources Business Partner at Matthews International Capital Management", "lastName": "F.", "id": "BhjSxmlOwB", "firstName": "Heidi"}}, {"company": {"id": 21836, "name": "CyberCoders"}, "descriptionSnippet": "If you are a Business Analyst with Salesforce.com implementation experience, please read on!We are a Global Investment Bank with beautiful offices in West Los Angeles. Our IT team is seeking a star Business Analyst with Salesforce implementation experience to join the team. We will take care of relocation costs from the Bay Area to LA. The Salesforce analyst / administrator will be responsible for", "locationDescription": "San Francisco, CA", "id": 9174230, "jobPoster": {"headline": "Executive Recruiter at CyberCoders", "lastName": "G.", "id": "UA7CCULbRj", "firstName": "Julia"}}, {"company": {"id": 163001, "name": "Chase"}, "descriptionSnippet": "Chase is the U.S. consumer and commercial banking business of JPMorgan Chase &amp; Co. (NYSE: JPM), a leading global financial services firm with assets of $2.3 trillion and operations in more than 60 countries We serve more than 50 million consumers and small businesses through more than 5,600 bank branches, 18,700 ATMs, credit cards, mortgage offices and online and mobile banking as well as thro", "locationDescription": "US-CA-San Francisco", "id": 9210646, "jobPoster": {"headline": "Vice President of Career Development at JPMorgan Chase", "lastName": "W.", "id": "65aE3S8BpF", "firstName": "Kevin"}}, {"company": {"id": 157326, "name": "Bank of the West"}, "descriptionSnippet": "Position Summary: Responsible for determining and documenting the business, data and functional requirements to support the development of certain PD, LGD and EAD models. Will collaborate with business, risk personnel and a model development team to determine and analyze the information needs and functional requirements and document these requirements in business requirements/ functional specifica", "locationDescription": "San Francisco Bay Area", "id": 9179338, "jobPoster": {"headline": "Vice President, Executive Recruiter at Bank of the West (BNP Paribas)", "lastName": "W.", "id": "1sWFU1hgyo", "firstName": "Joel"}}, {"company": {"id": 6229, "name": "Dolby Laboratories"}, "descriptionSnippet": "Sr. Treasury AnalystID 2013-2045 Job Location US-CA-San FranciscoCategory Accounting/FinanceOptions:- Apply for this job online- Email this job to a friendSocialize this job opportunity to a friend, colleague, or family member:More information about this job:Overview:Join the leader in entertainment innovation and help us design the future. At Dolby, science meets art, and high tech means more tha", "locationDescription": "San Francisco, CA", "id": 6192123, "jobPoster": {"headline": "Sourcer at Dolby Laboratories", "lastName": "R.", "id": "WhT6bEvbD8", "firstName": "Sarah"}}, {"company": {"id": 35865, "name": "Canaan Partners"}, "descriptionSnippet": "Canaan Partners is seeking an analyst who is energetic, passionate about technology, and intellectually curious to join its Menlo Park, CA Information Technology team.   This is a particularly exciting time to join a Venture Capital firm. It has never been easier spin up a startup, and there is more data available about markets, trends, and young companies than ever before. Our new analyst will ha", "locationDescription": "San Francisco Bay Area", "id": 7573234, "jobPoster": {"headline": "Scientist -> Entrepreneur -> Investor", "lastName": "W.", "id": "jjm07OOsCO", "firstName": "Roseanne"}}, {"salary": "Competitive", "company": {"name": "Confidential"}, "id": 7571877, "descriptionSnippet": "Client:   Our client is a provider of debt capital to venture capital and private equity-backed companies.  They are currently investing from a pool of dedicated capital in excess of $500M, and are seeking to add a senior level investment professional at the Principal or Director level in Bay Area.    Responsibilities:   Lead new investment opportunities sourced from existing personal networks and", "jobPoster": {"headline": "Managing Director at Pinnacle Group International", "lastName": "M.", "id": "9c4mlI4Eql", "firstName": "Brant"}, "locationDescription": "Bay Area, CA"}]}}