{"numResults": 1847, "facets": {"_total": 1, "values": [{"buckets": {"_total": 11, "values": [{"count": 111, "selected": false, "code": "497017", "name": "Morgan Stanley"}, {"count": 96, "selected": false, "code": "1767", "name": "State Street"}, {"count": 59, "selected": false, "code": "1067", "name": "J.P. Morgan"}, {"count": 47, "selected": false, "code": "2494", "name": "Bloomberg LP"}, {"count": 44, "selected": false, "code": "1872", "name": "SunGard"}, {"count": 37, "selected": false, "code": "1835", "name": "Allstate"}, {"count": 28, "selected": false, "code": "1073", "name": "EY"}, {"count": 28, "selected": false, "code": "2818", "name": "Ariba"}, {"count": 26, "selected": false, "code": "1068", "name": "JPMorgan Chase"}, {"count": 26, "selected": false, "code": "1307", "name": "Fidelity Investments"}, {"count": 24, "selected": false, "code": "3486", "name": "Hays"}]}, "code": "company", "name": "Company"}]}, "jobs": {"_total": 1847, "_count": 20, "_start": 0, "values": [{"company": {"id": 17700, "name": "Smith & Associates"}, "descriptionSnippet": "POSITION SUMMARY Develop business through networking and sales calls to sell semiconductors and electronic components equipment. PRINCIPLE ACCOUNTABILITIES Proven track record of success in electronics components trading or similar industry Diligent research for customer leads using the internet and other tools. Prospecting of customers to advertise the value added services that Smith has to offer", "locationDescription": "San Francisco Bay Area", "id": 9358805, "jobPoster": {"headline": "Vice President of Human Resources at Smith & Associates", "lastName": "M.", "id": "0MLEnpW5Kj", "firstName": "Leslie"}}, {"company": {"id": 13133, "name": "FXCM"}, "descriptionSnippet": "“Exciting opportunity for success and career advancement with one of the largest FX Brokers in the world” FXCM (NYSE:FXCM) is one of the world’s largest currency trading brokers seeking career-oriented, entry-level candidates ready to start a career in financial services. Top Benefits: Paid travel to Texas office for training Quarterly bonuses for top performers Strong team dynamic with frequent o", "locationDescription": "San Francisco, CA", "id": 6267236, "jobPoster": {"headline": "Manager, Talent Development & Acquisition at FXCM", "lastName": "W.", "id": "z7ODxSFYBy", "firstName": "Sarah"}}, {"company": {"id": 2818, "name": "Ariba"}, "descriptionSnippet": "Title: Account Executive Department:  Ariba North America Sales Location:  Sunnyvale, Southern California, Colorado, Utah Reports To: VP of Sales North America   Company Overview Come join the brightest, most dedicated, most energetic engineers, marketers, project managers, sales, service, and finance professionals in the Bay Area! Ariba, an SAP company, is the global leader in business commerce n", "locationDescription": "San Francisco Bay Area", "id": 7156420, "jobPoster": {"headline": "SR Recruiter Talent Acquisition", "lastName": "B.", "id": "Rw02-2t2JD", "firstName": "Vicki"}}, {"company": {"id": 3388, "name": "TD Ameritrade"}, "descriptionSnippet": "Role: This exciting opportunity is a retail leadership role that combines: sales sales coaching risk management training presentations/seminar delivery to help foster industry leading annuitized asset sales and retention. The success of this role is highly dependent on retail advisory/asset management knowledge, sales skills, coaching skills/credibility and strong influencing and relationship buil", "locationDescription": "San Francisco Bay Area", "id": 9117174, "jobPoster": {"lastName": "private", "id": "private", "firstName": "private"}}, {"company": {"id": 9125, "name": "Calypso Technology"}, "descriptionSnippet": "Professional Services Technical Analyst   Company Profile   Founded in 1997, Calypso Technology is a leading global application software provider for the capital markets industry, delivering an integrated suite of trading, risk and processing applications within many of the premier financial institutions including banks, asset managers, hedge funds, and other companies participating in the world’s", "locationDescription": "US-San Francisco", "id": 5980463, "jobPoster": {"headline": "Recruiting Coordinator at Calypso Technology", "lastName": "K.", "id": "563u4YoiGg", "firstName": "Dana"}}, {"company": {"id": 2494, "name": "Bloomberg LP"}, "descriptionSnippet": "Bloomberg Tradebook - Research Sales Representative- San FranciscoJob Requisition Number: 38132United StatesSan Francisco - USAThe Role:The successful candidate will have responsibility for coordinating with the firm's independent research partners (IRP), including building relationships and promoting their respective products to Tradebook's institutional clients and sales. This individual will be", "locationDescription": "San Francisco, CA", "id": 7559223, "jobPoster": {"headline": "Staffing, Operations & Systems at Bloomberg", "lastName": "F.", "id": "6QAg7oBDB6", "firstName": "Allen"}}, {"company": {"id": 109828, "name": "Adap.tv"}, "descriptionSnippet": "Director of Product Marketing for Advertisers - San Mateo, CA Adap.tv is seeking a Director of Product Marketing to position its groundbreaking video advertising platform and solutions to leading brands and advertising agencies in all geographies.   We are looking for a proven leader in the online advertising industry with deep knowledge of ad technologies and solutions across different devices (e", "locationDescription": "San Mateo, CA", "id": 9304617, "jobPoster": {"headline": "Lead Technical Recruiter at Adap.tv", "lastName": "H.", "id": "H-Vgmp0CVh", "firstName": "Brian"}}, {"company": {"id": 15700, "name": "Liquidnet"}, "descriptionSnippet": "You will be on a team responsible for cross-selling the Liquidnet trading system, CMS, Algo Trading Suite and other core Liquidnet products to buy side institutions/hedge funds in various geographical regions and owning the client relationship through the entire sales cycle.  You will provide product demonstrations to prospects and be able to explain the value of Liquidnet and what differentiates ", "locationDescription": "Greater New York City Area", "id": 7483802, "jobPoster": {"headline": "Talent Acquisition at Liquidnet", "lastName": "P.", "id": "nIiBaB2Osk", "firstName": "Tanya"}}, {"company": {"id": 566084, "name": "The Compliance Search Group, LLC"}, "descriptionSnippet": "Global investment bank seeks a supervisory professional for their fixed income sales and trading division.", "locationDescription": "New York, NY", "id": 9283603, "jobPoster": {"headline": "The Compliance Search Group, www.ComplianceJobs.com, www.CompliancEX.com, www.HedgeFundsX.com", "lastName": "K.", "id": "ITZWbzfFDp", "firstName": "Jack"}}, {"salary": "Commensurate to experience", "company": {"id": 38390, "name": "AOptix Technologies"}, "id": 6173460, "descriptionSnippet": "WE’RE HIRING!!!  Sales Director , US Central and East Canada.  AOptix Technologies is in the news! Our disruptive, industry first, hybrid wireless communications technology is poised as an alternative to the current fiber and wireless solutions for multiple vertical markets (Cellular - mobile backhaul, Financial - low latency links for high frequency trading, Enterprise – fiber equivalent connecti", "jobPoster": {"headline": "Staffing Consultant", "lastName": "M.", "id": "GJk5kVqy19", "firstName": "Phyllis"}, "locationDescription": "Campbell CA"}, {"salary": "Competitive", "company": {"id": 87701, "name": "Alamo Capital"}, "id": 6215301, "descriptionSnippet": "Market financial services by soliciting prospective and current clients; ascertaining their needs; explaining products and services; making sales presentations to groups Manage Investment portfolios by analyzing investment opportunities; purchasing and selling securities Identify current and future client service requirements by establishing personal rapport with potential and actual clients and o", "jobPoster": {"headline": "Talent Acquisition at Alamo Capital", "lastName": "F.", "id": "oTJSIxWWBD", "firstName": "Aleck"}, "locationDescription": "Walnut Creek, CA"}, {"company": {"id": 7677, "name": "E2open"}, "descriptionSnippet": "The Senior Director, Integrated Campaigns will provide executional and thought leadership in all aspects of the integrated marketing organization. This seasoned professional will have responsibility for strategic planning and execution of programs including, PR, website, events, regional field marketing, social media and infrastructure.   The Senior Director will lead a talented team of creative, ", "locationDescription": "Foster City, CA", "id": 9159456, "jobPoster": {"headline": "HR Manager at E2open,", "lastName": "D.", "id": "ZWIkkshIIr", "firstName": "Robin"}}, {"company": {"id": 497017, "name": "Morgan Stanley"}, "descriptionSnippet": "Overview: Sales and Trading From the largest global institutions to the latest hedge funds, investors come to Morgan Stanley for sales, trading, and market-making services in almost every type of financial instrument in all the world’s major financial markets, including stocks, bonds, derivatives, foreign exchange and commodities. Morgan Stanley professionals use the firm’s network and leading tec", "locationDescription": "United Kingdom - London", "id": 7212538, "jobPoster": {"headline": "Recruiting Business Analyst", "lastName": "W.", "id": "rYXtf0GTN0", "firstName": "Melissa"}}, {"company": {"id": 3318, "name": "Sky"}, "descriptionSnippet": "We have an exciting opportunity for a driven and dynamic individual to join the Trading team and be responsible for creating, optimising, and maintaining sales planning and performance for NOW TV. This is a high profile role with touch points across the business including; Marketing, Insight, and Finance, and will also work closely with the Business Science team of our media planning agency. The r", "locationDescription": "ENGLAND-Middlesex", "id": 9186126, "jobPoster": {"headline": "Hiring top talent into Marketing, Brand, Insight, Digital & Customer Management", "lastName": "S.", "id": "O0rFQwpTOe", "firstName": "Seema"}}, {"company": {"id": 3318, "name": "Sky"}, "descriptionSnippet": "We have an exciting opportunity for a driven and dynamic individual to join the Trading team and be responsible for creating, optimising, and maintaining sales planning and performance for NOW TV. This is a high profile role with touch points across the business including; Marketing, Insight, and Finance, and will also work closely with the Business Science team of our media planning agency. The r", "locationDescription": "ENGLAND-Middlesex", "id": 9186090, "jobPoster": {"headline": "Hiring top talent into Marketing, Brand, Insight, Digital & Customer Management", "lastName": "S.", "id": "O0rFQwpTOe", "firstName": "Seema"}}, {"company": {"id": 497017, "name": "Morgan Stanley"}, "descriptionSnippet": "The Sales &amp; Trading Industrial Placement Internship Programme is aimed at undergraduates who are completing a four-year degree in which a year out in industry is a requirement. This one year placement is based in London and begins in June 2014. It offers the opportunity to learn about a variety of product areas, while providing a clear understanding of how Sales &amp; Trading operates as a who", "locationDescription": "United Kingdom - London", "id": 7532182, "jobPoster": {"headline": "Recruiting Business Analyst", "lastName": "W.", "id": "rYXtf0GTN0", "firstName": "Melissa"}}, {"company": {"name": "Maxim Group, LLC "}, "descriptionSnippet": "Maxim Group,  a leading regional broker/dealer continues to expand its fixed income platform through individuals with complimentary networks/skill sets. The desk actively makes markets in Corporates (HG and HY), Preferreds, Agencies, Municipals, Converts, Sovereigns, EM, and Structured Credit. We are looking to add sales/trading personnel with significant buy-side relationships and traders with ex", "locationDescription": "Greater New York City Area", "id": 9142071, "jobPoster": {"headline": "Fixed Income Trader/Manager", "lastName": "T.", "id": "VHrlT3Jjpk", "firstName": "Jamie"}}, {"company": {"id": 63342, "name": "Greystripe"}, "descriptionSnippet": "Greystripe, a division of ValueClick, is the largest brand-focused mobile advertising network in the US by reach. Greystripe delivers the engagement for brand marketers and performance for direct response advertisers via our sophisticated targeting platform that leverages proprietary data from all connected devices. Greystripe leverages billions of rich media impressions to 85 million users of tou", "locationDescription": "San Francisco, CA", "id": 7020461, "jobPoster": {"lastName": "private", "id": "private", "firstName": "private"}}, {"company": {"id": 56870, "name": "Textainer"}, "descriptionSnippet": "Textainer currently has a Senior Accountant position open at our administrative headquarters office conveniently located in San Francisco’s Financial District.   This position is responsible for the accounting, finance and reporting for the Company’s Treasury Department. Specific duties include:   Internal and External Reporting: Prepare required treasury and finance related schedules for accounti", "locationDescription": "San Francisco Bay Area", "id": 9255687, "jobPoster": {"headline": "Human Resources at Textainer", "lastName": "O.", "id": "HXsIY4SIZS", "firstName": "Career"}}, {"company": {"id": 23488, "name": "Glam Media"}, "descriptionSnippet": "Manager of Ad Marketplace Integration  Brisbane, CA (SF Bay Area) Glam Media is a leading vertical social media company with the largest online global reach in lifestyle. We were founded in 2004 with a simple, yet powerful idea—that people are the most influential filters for discovering and sharing each other’s most passionate interests. Our mission is to help people create, discover and share co", "locationDescription": "San Francisco Bay Area", "id": 9236632, "jobPoster": {"headline": "Super busy hiring great people!", "lastName": "M.", "id": "mAIeEBCHGF", "firstName": "Zen"}}]}}