{"numResults": 1847, "facets": {"_total": 1, "values": [{"buckets": {"_total": 11, "values": [{"count": 111, "selected": false, "code": "497017", "name": "Morgan Stanley"}, {"count": 96, "selected": false, "code": "1767", "name": "State Street"}, {"count": 59, "selected": false, "code": "1067", "name": "J.P. Morgan"}, {"count": 47, "selected": false, "code": "2494", "name": "Bloomberg LP"}, {"count": 44, "selected": false, "code": "1872", "name": "SunGard"}, {"count": 37, "selected": false, "code": "1835", "name": "Allstate"}, {"count": 28, "selected": false, "code": "1073", "name": "EY"}, {"count": 28, "selected": false, "code": "2818", "name": "Ariba"}, {"count": 26, "selected": false, "code": "1068", "name": "JPMorgan Chase"}, {"count": 26, "selected": false, "code": "1307", "name": "Fidelity Investments"}, {"count": 24, "selected": false, "code": "3486", "name": "Hays"}]}, "code": "company", "name": "Company"}]}, "jobs": {"_total": 1847, "_count": 10, "_start": 40, "values": [{"company": {"id": 1181097, "name": "Apttus"}, "descriptionSnippet": "Have you been longing to find a place where your skills, talents, and aspirations will be recognized and rewarded?  Well, look no further – you have found our Business Development Representative (BDR) position at Apttus. The opportunities to grow are mind-boggling, because our highly-functional software application has the potential to reach many more than the millions of customers already using i", "locationDescription": "San Francisco Bay Area", "id": 9141541, "jobPoster": {"headline": "Associate", "lastName": "V.", "id": "ZwQq6EVo79", "firstName": "Severin"}}, {"company": {"id": 1872, "name": "SunGard"}, "descriptionSnippet": "Position Responsibilities  SunGard Financial Systems provides mission-critical software and IT services to institutions in virtually every segment of the financial services industry. The primary purpose of these systems is to automate the many detailed processes associated with trading, managing investment portfolios and accounting for investment assets. These solutions address the processing requ", "locationDescription": "US-CA-San Francisco 120 Montgomery", "id": 7102670, "jobPoster": {"headline": "Talent Acquisition Manager, Sales at SunGard Financial Systems", "lastName": "Y.", "id": "7CpcWTzEth", "firstName": "Vema"}}, {"company": {"id": 3249443, "name": "Ripple Labs"}, "descriptionSnippet": "Position Summary   The VP of Business Development for Financial Services will report to Ripple Labs’ EVP of Business Development and will lead and supervise Ripple Labs’ sales and business development efforts in the Financial Services category. This is a global position. It’s an exciting growth opportunity for candidates with an entrepreneurial mindset who can build and lead a sales and business d", "locationDescription": "San Francisco Bay Area", "id": 7528963, "jobPoster": {"headline": "Associate Program Manager at Sift Science", "lastName": "L.", "id": "aEpI3NKhrK", "firstName": "Lianna"}}, {"salary": "Commensurate with experience", "company": {"id": 74840, "name": "GSM Systems"}, "id": 7369600, "descriptionSnippet": "GSM Systems is looking for intelligent, positive, and adaptive hard workers to join our growing sales force. You crush your goals and you are proud of it.  For our salespeople, we offer an unparalleled opportunity to operate in a fast pace international sales environment where ambition is rewarded and we are all business builders.  If you have the confidence and hustle to open and close business f", "jobPoster": {"lastName": "private", "id": "private", "firstName": "private"}, "locationDescription": "Greater New York City Area"}, {"company": {"id": 63342, "name": "Greystripe"}, "descriptionSnippet": "You’ve probably heard of ValueClick, and may know something about what we do. We’re a company about endless possibilities. With many of the strongest businesses in Media (ValueClick Media), CRM (Dotomi), Mobile (Greystripe), Affiliate (Commission Junction), and Technology (Mediaplex) ValueClick, Inc. transforms client businesses – and the industry – every day! The key to our success is a culture o", "locationDescription": "San Francisco, CA", "id": 9241313, "jobPoster": {"lastName": "private", "id": "private", "firstName": "private"}}, {"company": {"id": 23282, "name": "Tremor Video"}, "descriptionSnippet": "If you want to join an ambitious team that is driving programmatic video everywhere, we want to hear from you!     The Sales / Business Development role for Tremor Extend (ideally based in San Francisco, Los Angeles or Chicago) is a new role for Tremor Video due to growth!  This person will be responsible for leveraging partnerships between existing agency relationships and our new product, Tremor", "locationDescription": "San Francisco Bay Area", "id": 7524682, "jobPoster": {"headline": "Talent Acquisition at Tremor Video", "lastName": "Blancato", "id": "wglh600B0o", "firstName": "Andrew"}}, {"company": {"id": 1067, "name": "J.P. Morgan"}, "descriptionSnippet": "J.P. Morgan's Corporate &amp; Investment Bank is a global leader across banking, markets and investor services. The world's most important corporations, governments and institutions entrust us with their business in more than 100 countries. With $18 trillion of assets under custody and $393 billion in deposits, the Corporate &amp; Investment Bank provides strategic advice, raises capital, manages ", "locationDescription": "US-TX-Houston", "id": 9166409, "jobPoster": {"headline": "Vice President of Career Development at JPMorgan Chase", "lastName": "W.", "id": "65aE3S8BpF", "firstName": "Kevin"}}, {"company": {"id": 3019, "name": "Staples"}, "descriptionSnippet": "Self-starters, dreamers, owners…there are a lot of words to describe the entrepreneurial spirit.  At Staples, you’ll find a culture that rewards them all.  Every Staples associate is given the opportunity to contribute, innovate and share in our financial success…people who create their own success and reap the rewards. That’s Staples — a company of entrepreneurs.  Are you ready to put your passio", "locationDescription": "San Francisco, US-CA", "id": 7552886, "jobPoster": {"headline": "Talent Acquisition Operations Coordinator", "lastName": "K.", "id": "gbWy9wYHrR", "firstName": "Tina"}}, {"company": {"id": 614912, "name": "Datalogix"}, "descriptionSnippet": "As “Head of Digital Media Partnerships” for Datalogix you’ll have global responsibility for business development, sales, account management and execution of all DLX audience and measurement products across our largest digital media partners.  These strategic partners rely on Datalogix to help them build the right consumer targeting and measurement solutions for their media, thus driving increased ", "locationDescription": "San Francisco Bay Area", "id": 6861665, "jobPoster": {"headline": "Technical, Digital Media & Corporate Recruiter", "lastName": "L.", "id": "2urcrq3nW0", "firstName": "Whitney"}}, {"company": {"id": 21836, "name": "CyberCoders"}, "descriptionSnippet": "Director of Technical Support - Software Product - Saint Louis, MO - On-SiteAre you looking to take your next step closer to executive management in a software company? Do you have a technical and customer support background? Are you willing to RELOCATE to St. Louis where housing is cheaper and the pace is much slower?If so, we have an amazing role that just opened for you!Based in St. Louis area,", "locationDescription": "San Jose, CA", "id": 7166085, "jobPoster": {"headline": "Technology Recruiting", "lastName": "W.", "id": "FOzmO4WqMH", "firstName": "Curt"}}]}}